In [1]:
import pandas as pd
import numpy as np

In [62]:
df = pd.read_csv('calendar.csv')
df.head()

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN

In [63]:
df.tail()

         listing_id        date available price
1393565    10208623  2016-12-29         f   NaN
1393566    10208623  2016-12-30         f   NaN
1393567    10208623  2016-12-31         f   NaN
1393568    10208623  2017-01-01         f   NaN
1393569    10208623  2017-01-02         f   NaN

In [64]:
# nul vals for col listing_id

df[df['listing_id'].isnull()]

Empty DataFrame
Columns: [listing_id, date, available, price]
Index: []

In [65]:
# nul vals for col date

df[df['date'].isnull()]

Empty DataFrame
Columns: [listing_id, date, available, price]
Index: []

In [66]:
# nul vals for col available

df[df['available'].isnull()]

Empty DataFrame
Columns: [listing_id, date, available, price]
Index: []

In [67]:
# nul vals for col price

df[df['price'].isnull()]

         listing_id        date available price
2            241032  2016-01-06         f   NaN
3            241032  2016-01-07         f   NaN
4            241032  2016-01-08         f   NaN
5            241032  2016-01-09         f   NaN
6            241032  2016-01-10         f   NaN
...             ...         ...       ...   ...
1393565    10208623  2016-12-29         f   NaN
1393566    10208623  2016-12-30         f   NaN
1393567    10208623  2016-12-31         f   NaN
1393568    10208623  2017-01-01         f   NaN
1393569    10208623  2017-01-02         f   NaN

[459028 rows x 4 columns]

In [69]:
# counting the nul vals in df

df.isna().sum().sum()

459028

In [70]:
# removing the nul vals using fillna()
df.fillna(value=0, inplace=True)

In [17]:
# counting the null vals again 

count_2 = df.isna().sum().sum()
print(count_2)

0

In [71]:
df.duplicated(subset=['listing_id'])

0          False
1           True
2           True
3           True
4           True
           ...
1393565     True
1393566     True
1393567     True
1393568     True
1393569     True
Length: 1393570, dtype: bool

In [72]:
df.duplicated(subset=['listing_id','available','date','price']).sum()

0

In [53]:
print(df[['listing_id','available','date','price']].describe(include="all"))

          listing_id available        date      price
count   1.393570e+06   1393570     1393570  1393570.0
unique           NaN         2         365      670.0
top              NaN         t  2016-01-04        0.0
freq             NaN    934542        3818   459028.0
mean    5.550111e+06       NaN         NaN        NaN
std     2.962274e+06       NaN         NaN        NaN
min     3.335000e+03       NaN         NaN        NaN
25%     3.258213e+06       NaN         NaN        NaN
50%     6.118244e+06       NaN         NaN        NaN
75%     8.035212e+06       NaN         NaN        NaN
max     1.034016e+07       NaN         NaN        NaN

In [55]:
print(df[["listing_id"]].describe(include="all"))

         listing_id
count  1.393570e+06
mean   5.550111e+06
std    2.962274e+06
min    3.335000e+03
25%    3.258213e+06
50%    6.118244e+06
75%    8.035212e+06
max    1.034016e+07

In [29]:
# DESCRIBING THE VALS OF AVAILABLE COL
df[["available"]].describe(include="all")

       available
count    1393570
unique         2
top            t
freq      934542

In [61]:
# DESCRIBING THE VALS OF DATE COL

df[["date"]].describe(include="all")

              date
count      1393570
unique         365
top     2016-01-04
freq          3818

In [83]:
# DESCRIBING THE VALS OF PRICE COL
df["price"].describe(include="all")

count     1393570
unique        670
top             0
freq       459028
Name: price, dtype: int64

In [60]:
df.describe()

         listing_id
count  1.393570e+06
mean   5.550111e+06
std    2.962274e+06
min    3.335000e+03
25%    3.258213e+06
50%    6.118244e+06
75%    8.035212e+06
max    1.034016e+07

In [76]:
df.describe().loc['mean']

listing_id    5.550111e+06
Name: mean, dtype: float64

In [77]:
df.describe().loc['std']

listing_id    2.962274e+06
Name: std, dtype: float64

In [78]:
df.describe().loc['75%']

listing_id    8035212.0
Name: 75%, dtype: float64